package geekbrains.lesson_1.hello_world;

public class Main {
    private static int a = 1, b = 2, c = 3;
    private static double d = 4.1;
    private static float f, g, h, k = 10.0f;
    private static 
    public static void main(String[] args) {
	  System.out.println("Я буду изучать Java!");
      f = 5.1f; g = 14.78f; h = 13.7f;
    }
}

/*
1. Создать пустой проект в IntelliJ IDEA и прописать метод main();
2. Создать переменные всех пройденных типов данных, и инициализировать их значения;
3. Написать метод вычисляющий выражение a * (b + (c / d)) и возвращающий результат,
        где a, b, c, d – входные параметры этого метода;
4. Написать метод, принимающий на вход два числа, и проверяющий что их сумма лежит
        в пределах от 10 до 20(включительно), если да – вернуть true, в противном случае – false;
5. Написать метод, которому в качестве параметра передается целое число,
        метод должен напечатать в консоль положительное ли число передали, или отрицательное;
        Замечание: ноль считаем положительным числом.
6. Написать метод, которому в качестве параметра передается целое число,
        метод должен вернуть true, если число отрицательное;
7. Написать метод, которому в качестве параметра передается строка, обозначающая имя,
        метод должен вывести в консоль сообщение «Привет, указанное_имя!»;
8. * Написать метод, который определяет является ли год високосным, и выводит сообщение в консоль.
        Каждый 4-й год является високосным, кроме каждого 100-го, при этом каждый 400-й – високосный.

 */